Revit.AnalysisDisplay.VectorAnalysisDisplay.#ctor(Autodesk.Revit.DB.View,System.Collections.Generic.IEnumerable{Analysis.DataTypes.VectorAnalysisData},System.String,System.String,System.Type)
Create a Point Analysis Display in the current view
view:
sampleLocations:
samples:

Revit.AnalysisDisplay.VectorAnalysisDisplay.InternalSetSpatialFieldValues(System.Int32,Analysis.DataTypes.VectorAnalysisData,System.String,System.String,System.Type)
Set the spatial field values for the current spatial field primitive.  The two
input sequences should be of the same length.
sampleLocations:
samples:

Revit.AnalysisDisplay.VectorAnalysisDisplay.ByViewAndVectorAnalysisData(Revit.Elements.Views.View,Analysis.DataTypes.VectorAnalysisData[],System.String,System.String,System.Type)
Show a Vector Analysis Display in the Revit view.
view: The view into which you want to draw the analysis results.
data: A list of VectorAnalysisData objects.
name: An optional analysis results name to show on the results legend.
description: An optional analysis results description to show on the results legend.
unitType: An optional Unit type to provide conversions in the analysis results.
Returns: A VectorAnalysisDisplay object.